# Вставить элемент

# Дан список целых чисел, число k и значение C. Необходимо вставить в список
# на позицию с индексом k элемент, равный C, сдвинув все элементы, имевшие
# индекс не менее k, вправо.
#
# Поскольку при этом количество элементов в списке увеличивается, после
# считывания списка в его конец нужно будет добавить новый элемент, используя
# метод append.
#
# Вставку необходимо осуществлять уже в считанном списке, не делая этого при
# выводе и не создавая дополнительного списка.

lst = list(map(int, input().split()))
k, C = list(map(int, input().split()))

lst.append(0)
for i in range(len(lst)-1, k, -1):
    lst[i] = lst[i-1]
lst[k] = C
print(' '.join(map(str, lst)))
